GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_qspi.h
/**
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_qspi.h
  * @author  FMSH Application Team
  * @brief   Head file of QSPI FL Module
  *******************************************************************************************************
 * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FH0XX_FL_QSPI_H
#define __FM33FH0XX_FL_QSPI_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fh0xx_fl_def.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup QSPI_FL_ES_INIT QSPI Exported Init structures
  * @{
  */

/**
  * @brief FL QSPI Init Sturcture definition
  */
typedef struct
{
    /* 时钟预分频系数 */
    uint32_t ClockPrescaler;    
    /* FIFO水位 */                          
    uint32_t FifoThreshold;     
    /* 延迟采样功能 */                          
    uint32_t SampleShifting;    
    /* nCS最小高电平时间 */                                                            
    uint32_t ChipSelectHighTime;
    /* Clock Mode */                                                        
    uint32_t ClockMode;

}QSPI_InitTypeDef;

typedef struct
{
    /* instruction phase. */
    uint32_t Instruction;
    uint32_t InstructionMode;
 
    /* addr phase. */
    uint32_t Address;
    uint32_t AddressSize;
    uint32_t AddressMode;
 
    /* alt phase. */
    uint32_t AlternateByte;
    uint32_t AlternateByteSize;
    uint32_t AlternateByteMode;
 
    /* dummy phase. */
    uint32_t DummyCycles;
    
    /* data phase. */
    uint32_t DataMode;
    uint32_t DataLen;

}QSPI_CmdTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup QSPI_FL_Exported_Constants QSPI Exported Constants
  * @{
  */

#define    QSPI_CR_PRESCALER_Pos                                  (24U)
#define    QSPI_CR_PRESCALER_Msk                                  (0xffU << QSPI_CR_PRESCALER_Pos)
#define    QSPI_CR_PRESCALER                                      QSPI_CR_PRESCALER_Msk

#define    QSPI_CR_PMM_Pos                                        (23U)
#define    QSPI_CR_PMM_Msk                                        (0x1U << QSPI_CR_PMM_Pos)
#define    QSPI_CR_PMM                                            QSPI_CR_PMM_Msk

#define    QSPI_CR_TOIE_Pos                                       (20U)
#define    QSPI_CR_TOIE_Msk                                       (0x1U << QSPI_CR_TOIE_Pos)
#define    QSPI_CR_TOIE                                           QSPI_CR_TOIE_Msk

#define    QSPI_CR_SMIE_Pos                                       (19U)
#define    QSPI_CR_SMIE_Msk                                       (0x1U << QSPI_CR_SMIE_Pos)
#define    QSPI_CR_SMIE                                           QSPI_CR_SMIE_Msk

#define    QSPI_CR_FTIE_Pos                                       (18U)
#define    QSPI_CR_FTIE_Msk                                       (0x1U << QSPI_CR_FTIE_Pos)
#define    QSPI_CR_FTIE                                           QSPI_CR_FTIE_Msk

#define    QSPI_CR_TCIE_Pos                                       (17U)
#define    QSPI_CR_TCIE_Msk                                       (0x1U << QSPI_CR_TCIE_Pos)
#define    QSPI_CR_TCIE                                           QSPI_CR_TCIE_Msk

#define    QSPI_CR_TEIE_Pos                                       (16U)
#define    QSPI_CR_TEIE_Msk                                       (0x1U << QSPI_CR_TEIE_Pos)
#define    QSPI_CR_TEIE                                           QSPI_CR_TEIE_Msk

#define    QSPI_CR_FIFOTHR_Pos                                    (8U)
#define    QSPI_CR_FIFOTHR_Msk                                    (0xfU << QSPI_CR_FIFOTHR_Pos)
#define    QSPI_CR_FIFOTHR                                        QSPI_CR_FIFOTHR_Msk

#define    QSPI_CR_SSHFT_Pos                                      (4U)
#define    QSPI_CR_SSHFT_Msk                                      (0x1U << QSPI_CR_SSHFT_Pos)
#define    QSPI_CR_SSHFT                                          QSPI_CR_SSHFT_Msk

#define    QSPI_CR_TCEN_Pos                                       (3U)
#define    QSPI_CR_TCEN_Msk                                       (0x1U << QSPI_CR_TCEN_Pos)
#define    QSPI_CR_TCEN                                           QSPI_CR_TCEN_Msk

