GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_qspi.h
#define    QSPI_CR_DMAEN_Pos                                      (2U)
#define    QSPI_CR_DMAEN_Msk                                      (0x1U << QSPI_CR_DMAEN_Pos)
#define    QSPI_CR_DMAEN                                          QSPI_CR_DMAEN_Msk

#define    QSPI_CR_ABORT_Pos                                      (1U)
#define    QSPI_CR_ABORT_Msk                                      (0x1U << QSPI_CR_ABORT_Pos)
#define    QSPI_CR_ABORT                                          QSPI_CR_ABORT_Msk

#define    QSPI_CR_EN_Pos                                         (0U)
#define    QSPI_CR_EN_Msk                                         (0x1U << QSPI_CR_EN_Pos)
#define    QSPI_CR_EN                                             QSPI_CR_EN_Msk

#define    QSPI_CFG_CSHT_Pos                                      (8U)
#define    QSPI_CFG_CSHT_Msk                                      (0x7U << QSPI_CFG_CSHT_Pos)
#define    QSPI_CFG_CSHT                                          QSPI_CFG_CSHT_Msk

#define    QSPI_CFG_CKMODE_Pos                                    (0U)
#define    QSPI_CFG_CKMODE_Msk                                    (0x1U << QSPI_CFG_CKMODE_Pos)
#define    QSPI_CFG_CKMODE                                        QSPI_CFG_CKMODE_Msk

#define    QSPI_SR_FIFOLVL_Pos                                    (8U)
#define    QSPI_SR_FIFOLVL_Msk                                    (0x1fU << QSPI_SR_FIFOLVL_Pos)
#define    QSPI_SR_FIFOLVL                                        QSPI_SR_FIFOLVL_Msk

#define    QSPI_SR_BUSY_Pos                                       (5U)
#define    QSPI_SR_BUSY_Msk                                       (0x1U << QSPI_SR_BUSY_Pos)
#define    QSPI_SR_BUSY                                           QSPI_SR_BUSY_Msk

#define    QSPI_SR_TOF_Pos                                        (4U)
#define    QSPI_SR_TOF_Msk                                        (0x1U << QSPI_SR_TOF_Pos)
#define    QSPI_SR_TOF                                            QSPI_SR_TOF_Msk

#define    QSPI_SR_SMF_Pos                                        (3U)
#define    QSPI_SR_SMF_Msk                                        (0x1U << QSPI_SR_SMF_Pos)
#define    QSPI_SR_SMF                                            QSPI_SR_SMF_Msk

#define    QSPI_SR_FTF_Pos                                        (2U)
#define    QSPI_SR_FTF_Msk                                        (0x1U << QSPI_SR_FTF_Pos)
#define    QSPI_SR_FTF                                            QSPI_SR_FTF_Msk

#define    QSPI_SR_TCF_Pos                                        (1U)
#define    QSPI_SR_TCF_Msk                                        (0x1U << QSPI_SR_TCF_Pos)
#define    QSPI_SR_TCF                                            QSPI_SR_TCF_Msk

#define    QSPI_DATALEN_DATALEN_Pos                               (0U)
#define    QSPI_DATALEN_DATALEN_Msk                               (0xffffffffU << QSPI_DATALEN_DATALEN_Pos)
#define    QSPI_DATALEN_DATALEN                                   QSPI_DATALEN_DATALEN_Msk

#define    QSPI_CCR_CRM_Pos                                       (28U)
#define    QSPI_CCR_CRM_Msk                                       (0x1U << QSPI_CCR_CRM_Pos)
#define    QSPI_CCR_CRM                                           QSPI_CCR_CRM_Msk

#define    QSPI_CCR_OPMODE_Pos                                    (26U)
#define    QSPI_CCR_OPMODE_Msk                                    (0x3U << QSPI_CCR_OPMODE_Pos)
#define    QSPI_CCR_OPMODE                                        QSPI_CCR_OPMODE_Msk

#define    QSPI_CCR_DMODE_Pos                                     (24U)
#define    QSPI_CCR_DMODE_Msk                                     (0x3U << QSPI_CCR_DMODE_Pos)
#define    QSPI_CCR_DMODE                                         QSPI_CCR_DMODE_Msk

#define    QSPI_CCR_DUMCYC_Pos                                    (18U)
#define    QSPI_CCR_DUMCYC_Msk                                    (0x1fU << QSPI_CCR_DUMCYC_Pos)
#define    QSPI_CCR_DUMCYC                                        QSPI_CCR_DUMCYC_Msk

#define    QSPI_CCR_ABSIZE_Pos                                    (16U)
#define    QSPI_CCR_ABSIZE_Msk                                    (0x3U << QSPI_CCR_ABSIZE_Pos)
#define    QSPI_CCR_ABSIZE                                        QSPI_CCR_ABSIZE_Msk

#define    QSPI_CCR_ABMODE_Pos                                    (14U)
#define    QSPI_CCR_ABMODE_Msk                                    (0x3U << QSPI_CCR_ABMODE_Pos)
#define    QSPI_CCR_ABMODE                                        QSPI_CCR_ABMODE_Msk

#define    QSPI_CCR_ADSIZE_Pos                                    (12U)
#define    QSPI_CCR_ADSIZE_Msk                                    (0x3U << QSPI_CCR_ADSIZE_Pos)
#define    QSPI_CCR_ADSIZE                                        QSPI_CCR_ADSIZE_Msk

#define    QSPI_CCR_ADMODE_Pos                                    (10U)
#define    QSPI_CCR_ADMODE_Msk                                    (0x3U << QSPI_CCR_ADMODE_Pos)
#define    QSPI_CCR_ADMODE                                        QSPI_CCR_ADMODE_Msk

#define    QSPI_CCR_IMODE_Pos                                     (8U)
#define    QSPI_CCR_IMODE_Msk                                     (0x3U << QSPI_CCR_IMODE_Pos)
#define    QSPI_CCR_IMODE                                         QSPI_CCR_IMODE_Msk

#define    QSPI_CCR_INSTRUCTION_Pos                               (0U)
#define    QSPI_CCR_INSTRUCTION_Msk                               (0xffU << QSPI_CCR_INSTRUCTION_Pos)
#define    QSPI_CCR_INSTRUCTION                                   QSPI_CCR_INSTRUCTION_Msk

#define    QSPI_ADDR_ADDR_Pos                                     (0U)
#define    QSPI_ADDR_ADDR_Msk                                     (0xffffffffU << QSPI_ADDR_ADDR_Pos)
#define    QSPI_ADDR_ADDR                                         QSPI_ADDR_ADDR_Msk

#define    QSPI_ABR_ABR_Pos                                       (0U)
#define    QSPI_ABR_ABR_Msk                                       (0xffffffffU << QSPI_ABR_ABR_Pos)
#define    QSPI_ABR_ABR                                           QSPI_ABR_ABR_Msk

#define    QSPI_DR_DATA_Pos                                       (0U)
#define    QSPI_DR_DATA_Msk                                       (0xffffffffU << QSPI_DR_DATA_Pos)
#define    QSPI_DR_DATA                                            QSPI_DR_DATA_Msk

#define    QSPI_SMSK_SMSK_Pos                                     (0U)
#define    QSPI_SMSK_SMSK_Msk                                     (0xffffffffU << QSPI_SMSK_SMSK_Pos)
#define    QSPI_SMSK_SMSK                                         QSPI_SMSK_SMSK_Msk

